Revit 2026 API

# PointCloudFilter Methods

---

The PointCloudFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PrepareForCell | Informs the filter that a series of points within a given cell is about to be checked. |
|  | TestCell | Checks whether a given cell, i.e. a box aligned with the XYZ axes, is inside, outside or on the border of the volume of interest. |
|  | TestPoint | Checks if a point is inside the volume of interest. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PointCloudFilter Class

Autodesk.Revit.DB.PointClouds Namespace